{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 68], "input_dtype": "int32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "input_dtype": "int32", "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 22, "batch_input_shape": [null, 68], "W_regularizer": null, "dropout": 0.0, "output_dim": 64, "input_length": 68}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "embedding_1"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_2", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 22, "batch_input_shape": [null, 4], "W_regularizer": null, "dropout": 0.0, "output_dim": 64, "input_length": 4}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "embedding_2"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["embedding_2", 0, 0]]], "name": "dropout_2"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_3", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 22, "batch_input_shape": [null, 68], "W_regularizer": null, "dropout": 0.0, "output_dim": 4, "input_length": 68}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "embedding_3"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [2, 2], "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "dot", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_1", 0, 0], ["dropout_2", 0, 0]]], "name": "merge_1"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["embedding_3", 0, 0]]], "name": "dropout_3"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_1", 0, 0], ["dropout_3", 0, 0]]], "name": "merge_2"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_1"}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "permute_1"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["permute_1", 0, 0], ["dropout_2", 0, 0]]], "name": "merge_3"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 132, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 32, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "lstm_1"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["lstm_1", 0, 0]]], "name": "dropout_4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 32, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 22}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "dense_1"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "activation_1"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_1"}}